grevaillot/svd_tools/headers/STM32G473xx/fdcan2.h
#pragma once 

/* --- FDCAN2: FDCAN ------------------------------------------------ */

/** @defgroup fdcan2_registers FDCAN Register
@{*/

/** FDCAN2_CREL FDCAN Core Release Register **/
#define FDCAN2_CREL			MMIO32(FDCAN2_BASE + 0x00)
/** FDCAN2_ENDN FDCAN Core Release Register **/
#define FDCAN2_ENDN			MMIO32(FDCAN2_BASE + 0x04)
/** FDCAN2_DBTP This register is only writable if bits CCCR.CCE and CCCR.INIT are set. The CAN bit time may be programed in the range of 4 to 25 time quanta. The CAN time quantum may be programmed in the range of 1 to 1024 FDCAN clock periods. tq = (DBRP + 1) FDCAN clock period. DTSEG1 is the sum of Prop_Seg and Phase_Seg1. DTSEG2 is Phase_Seg2. Therefore the length of the bit time is (programmed values) [DTSEG1 + DTSEG2 + 3] tq or (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 + Phase_Seg2] tq. The Information Processing Time (IPT) is zero, meaning the data for the next bit is available at the first clock edge after the sample point. **/
#define FDCAN2_DBTP			MMIO32(FDCAN2_BASE + 0x0c)
/** FDCAN2_TEST Write access to the Test Register has to be enabled by setting bit CCCR[TEST] to 1 . All Test Register functions are set to their reset values when bit CCCR[TEST] is reset. Loop Back mode and software control of Tx pin FDCANx_TX are hardware test modes. Programming TX differently from 00 may disturb the message transfer on the CAN bus. **/
#define FDCAN2_TEST			MMIO32(FDCAN2_BASE + 0x10)
/** FDCAN2_RWD The RAM Watchdog monitors the READY output of the Message RAM. A Message RAM access starts the Message RAM Watchdog Counter with the value configured by the RWD[WDC] bits. The counter is reloaded with RWD[WDC] bits when the Message RAM signals successful completion by activating its READY output. In case there is no response from the Message RAM until the counter has counted down to 0, the counter stops and interrupt flag IR[WDI] bit is set. The RAM Watchdog Counter is clocked by the fdcan_pclk clock. **/
#define FDCAN2_RWD			MMIO32(FDCAN2_BASE + 0x14)
/** FDCAN2_CCCR For details about setting and resetting of single bits see Software initialization. **/
#define FDCAN2_CCCR			MMIO32(FDCAN2_BASE + 0x18)
/** FDCAN2_NBTP FDCAN_NBTP **/
#define FDCAN2_NBTP			MMIO32(FDCAN2_BASE + 0x1c)
/** FDCAN2_TSCC FDCAN Timestamp Counter Configuration Register **/
#define FDCAN2_TSCC			MMIO32(FDCAN2_BASE + 0x20)
/** FDCAN2_TSCV FDCAN Timestamp Counter Value Register **/
#define FDCAN2_TSCV			MMIO32(FDCAN2_BASE + 0x24)
/** FDCAN2_TOCC FDCAN Timeout Counter Configuration Register **/
#define FDCAN2_TOCC			MMIO32(FDCAN2_BASE + 0x28)
/** FDCAN2_TOCV FDCAN Timeout Counter Value Register **/
#define FDCAN2_TOCV			MMIO32(FDCAN2_BASE + 0x2c)
/** FDCAN2_ECR FDCAN Error Counter Register **/
#define FDCAN2_ECR			MMIO32(FDCAN2_BASE + 0x40)
/** FDCAN2_PSR FDCAN Protocol Status Register **/
#define FDCAN2_PSR			MMIO32(FDCAN2_BASE + 0x44)
/** FDCAN2_TDCR FDCAN Transmitter Delay Compensation Register **/
#define FDCAN2_TDCR			MMIO32(FDCAN2_BASE + 0x48)
/** FDCAN2_IR The flags are set when one of the listed conditions is detected (edge-sensitive). The flags remain set until the Host clears them. A flag is cleared by writing a 1 to the corresponding bit position. Writing a 0 has no effect. A hard reset will clear the register. The configuration of IE controls whether an interrupt is generated. The configuration of ILS controls on which interrupt line an interrupt is signaled. **/
#define FDCAN2_IR			MMIO32(FDCAN2_BASE + 0x50)
/** FDCAN2_IE The settings in the Interrupt Enable register determine which status changes in the Interrupt Register will be signaled on an interrupt line. **/
#define FDCAN2_IE			MMIO32(FDCAN2_BASE + 0x54)
/** FDCAN2_ILS The Interrupt Line Select register assigns an interrupt generated by a specific interrupt flag from the Interrupt Register to one of the two module interrupt lines. For interrupt generation the respective interrupt line has to be enabled via ILE[EINT0] and ILE[EINT1]. **/
#define FDCAN2_ILS			MMIO32(FDCAN2_BASE + 0x58)
/** FDCAN2_ILE Each of the two interrupt lines to the CPU can be enabled/disabled separately by programming bits EINT0 and EINT1. **/
#define FDCAN2_ILE			MMIO32(FDCAN2_BASE + 0x5c)
/** FDCAN2_RXGFC Global settings for Message ID filtering. The Global Filter Configuration controls the filter path for standard and extended messages as described in Figure706: Standard Message ID filter path and Figure707: Extended Message ID filter path. **/
#define FDCAN2_RXGFC			MMIO32(FDCAN2_BASE + 0x80)
/** FDCAN2_XIDAM FDCAN Extended ID and Mask Register **/
#define FDCAN2_XIDAM			MMIO32(FDCAN2_BASE + 0x84)
/** FDCAN2_HPMS This register is updated every time a Message ID filter element configured to generate a priority event match. This can be used to monitor the status of incoming high priority messages and to enable fast access to these messages. **/
#define FDCAN2_HPMS			MMIO32(FDCAN2_BASE + 0x88)
/** FDCAN2_RXF0S FDCAN Rx FIFO 0 Status Register **/
#define FDCAN2_RXF0S			MMIO32(FDCAN2_BASE + 0x90)
/** FDCAN2_RXF0A CAN Rx FIFO 0 Acknowledge Register **/
#define FDCAN2_RXF0A			MMIO32(FDCAN2_BASE + 0x94)
/** FDCAN2_RXF1S FDCAN Rx FIFO 1 Status Register **/
#define FDCAN2_RXF1S			MMIO32(FDCAN2_BASE + 0x98)
/** FDCAN2_RXF1A FDCAN Rx FIFO 1 Acknowledge Register **/
#define FDCAN2_RXF1A			MMIO32(FDCAN2_BASE + 0x9c)
/** FDCAN2_TXBC FDCAN Tx Buffer Configuration Register **/
#define FDCAN2_TXBC			MMIO32(FDCAN2_BASE + 0xc0)
/** FDCAN2_TXFQS The Tx FIFO/Queue status is related to the pending Tx requests listed in register TXBRP. Therefore the effect of Add/Cancellation requests may be delayed due to a running Tx scan (TXBRP not yet updated). **/
#define FDCAN2_TXFQS			MMIO32(FDCAN2_BASE + 0xc4)
/** FDCAN2_TXBRP FDCAN Tx Buffer Request Pending Register **/
#define FDCAN2_TXBRP			MMIO32(FDCAN2_BASE + 0xc8)
/** FDCAN2_TXBAR FDCAN Tx Buffer Add Request Register **/
#define FDCAN2_TXBAR			MMIO32(FDCAN2_BASE + 0xcc)
/** FDCAN2_TXBCR FDCAN Tx Buffer Cancellation Request Register **/
#define FDCAN2_TXBCR			MMIO32(FDCAN2_BASE + 0xd0)
/** FDCAN2_TXBTO FDCAN Tx Buffer Transmission Occurred Register **/
#define FDCAN2_TXBTO			MMIO32(FDCAN2_BASE + 0xd4)
/** FDCAN2_TXBCF FDCAN Tx Buffer Cancellation Finished Register **/
#define FDCAN2_TXBCF			MMIO32(FDCAN2_BASE + 0xd8)
/** FDCAN2_TXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register **/
#define FDCAN2_TXBTIE			MMIO32(FDCAN2_BASE + 0xdc)
/** FDCAN2_TXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register **/
#define FDCAN2_TXBCIE			MMIO32(FDCAN2_BASE + 0xe0)
/** FDCAN2_TXEFS FDCAN Tx Event FIFO Status Register **/
#define FDCAN2_TXEFS			MMIO32(FDCAN2_BASE + 0xe4)
/** FDCAN2_TXEFA FDCAN Tx Event FIFO Acknowledge Register **/
#define FDCAN2_TXEFA			MMIO32(FDCAN2_BASE + 0xe8)
/** FDCAN2_CKDIV FDCAN CFG clock divider register **/
#define FDCAN2_CKDIV			MMIO32(FDCAN2_BASE + 0x100)

/**@}*/


/** @defgroup fdcan2_crel CREL FDCAN Core Release Register
@{*/


