grevaillot/svd_tools/headers/STM32G473xx/fdcan2.h
#define FDCAN2_CREL_REL_SHIFT		28
#define FDCAN2_CREL_REL_MASK		0x0f
/** @defgroup fdcan2_crel_rel REL REL
@{*/
/**@}*/


#define FDCAN2_CREL_STEP_SHIFT		24
#define FDCAN2_CREL_STEP_MASK		0x0f
/** @defgroup fdcan2_crel_step STEP STEP
@{*/
/**@}*/


#define FDCAN2_CREL_SUBSTEP_SHIFT		20
#define FDCAN2_CREL_SUBSTEP_MASK		0x0f
/** @defgroup fdcan2_crel_substep SUBSTEP SUBSTEP
@{*/
/**@}*/


#define FDCAN2_CREL_YEAR_SHIFT		16
#define FDCAN2_CREL_YEAR_MASK		0x0f
/** @defgroup fdcan2_crel_year YEAR YEAR
@{*/
/**@}*/


#define FDCAN2_CREL_MON_SHIFT		8
#define FDCAN2_CREL_MON_MASK		0xff
/** @defgroup fdcan2_crel_mon MON MON
@{*/
/**@}*/


#define FDCAN2_CREL_DAY_SHIFT		0
#define FDCAN2_CREL_DAY_MASK		0xff
/** @defgroup fdcan2_crel_day DAY DAY
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_endn ENDN FDCAN Core Release Register
@{*/


#define FDCAN2_ENDN_ETV_SHIFT		0
#define FDCAN2_ENDN_ETV_MASK		0xffffffff
/** @defgroup fdcan2_endn_etv ETV ETV
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_dbtp DBTP This register is only writable if bits CCCR.CCE and CCCR.INIT are set. The CAN bit time may be programed in the range of 4 to 25 time quanta. The CAN time quantum may be programmed in the range of 1 to 1024 FDCAN clock periods. tq = (DBRP + 1) FDCAN clock period. DTSEG1 is the sum of Prop_Seg and Phase_Seg1. DTSEG2 is Phase_Seg2. Therefore the length of the bit time is (programmed values) [DTSEG1 + DTSEG2 + 3] tq or (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 + Phase_Seg2] tq. The Information Processing Time (IPT) is zero, meaning the data for the next bit is available at the first clock edge after the sample point.
@{*/

/** FDCAN2_DBTP_TDC TDC **/
#define FDCAN2_DBTP_TDC		(1 << 23)

#define FDCAN2_DBTP_DBRP_SHIFT		16
#define FDCAN2_DBTP_DBRP_MASK		0x1f
/** @defgroup fdcan2_dbtp_dbrp DBRP DBRP
@{*/
/**@}*/


#define FDCAN2_DBTP_DTSEG1_SHIFT		8
#define FDCAN2_DBTP_DTSEG1_MASK		0x1f
/** @defgroup fdcan2_dbtp_dtseg1 DTSEG1 DTSEG1
@{*/
/**@}*/


#define FDCAN2_DBTP_DTSEG2_SHIFT		4
#define FDCAN2_DBTP_DTSEG2_MASK		0x0f
/** @defgroup fdcan2_dbtp_dtseg2 DTSEG2 DTSEG2
@{*/
/**@}*/


#define FDCAN2_DBTP_DSJW_SHIFT		0
#define FDCAN2_DBTP_DSJW_MASK		0x0f
/** @defgroup fdcan2_dbtp_dsjw DSJW DSJW
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_test TEST Write access to the Test Register has to be enabled by setting bit CCCR[TEST] to 1 . All Test Register functions are set to their reset values when bit CCCR[TEST] is reset. Loop Back mode and software control of Tx pin FDCANx_TX are hardware test modes. Programming TX differently from 00 may disturb the message transfer on the CAN bus.
@{*/

/** FDCAN2_TEST_RX RX **/
#define FDCAN2_TEST_RX		(1 << 7)

#define FDCAN2_TEST_TX_SHIFT		5
#define FDCAN2_TEST_TX_MASK		0x03
/** @defgroup fdcan2_test_tx TX TX
@{*/
/**@}*/

/** FDCAN2_TEST_LBCK LBCK **/
#define FDCAN2_TEST_LBCK		(1 << 4)

/**@}*/

/** @defgroup fdcan2_rwd RWD The RAM Watchdog monitors the READY output of the Message RAM. A Message RAM access starts the Message RAM Watchdog Counter with the value configured by the RWD[WDC] bits. The counter is reloaded with RWD[WDC] bits when the Message RAM signals successful completion by activating its READY output. In case there is no response from the Message RAM until the counter has counted down to 0, the counter stops and interrupt flag IR[WDI] bit is set. The RAM Watchdog Counter is clocked by the fdcan_pclk clock.
@{*/


#define FDCAN2_RWD_WDV_SHIFT		8
#define FDCAN2_RWD_WDV_MASK		0xff
/** @defgroup fdcan2_rwd_wdv WDV WDV
@{*/
/**@}*/


#define FDCAN2_RWD_WDC_SHIFT		0
#define FDCAN2_RWD_WDC_MASK		0xff
/** @defgroup fdcan2_rwd_wdc WDC WDC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_cccr CCCR For details about setting and resetting of single bits see Software initialization.
@{*/

/** FDCAN2_CCCR_NISO NISO **/
#define FDCAN2_CCCR_NISO		(1 << 15)
/** FDCAN2_CCCR_TXP TXP **/
#define FDCAN2_CCCR_TXP		(1 << 14)
/** FDCAN2_CCCR_EFBI EFBI **/
#define FDCAN2_CCCR_EFBI		(1 << 13)
/** FDCAN2_CCCR_PXHD PXHD **/
#define FDCAN2_CCCR_PXHD		(1 << 12)
/** FDCAN2_CCCR_BRSE BRSE **/
#define FDCAN2_CCCR_BRSE		(1 << 9)
/** FDCAN2_CCCR_FDOE FDOE **/
#define FDCAN2_CCCR_FDOE		(1 << 8)
/** FDCAN2_CCCR_TEST TEST **/
#define FDCAN2_CCCR_TEST		(1 << 7)
/** FDCAN2_CCCR_DAR DAR **/
#define FDCAN2_CCCR_DAR		(1 << 6)
/** FDCAN2_CCCR_MON MON **/
#define FDCAN2_CCCR_MON		(1 << 5)
/** FDCAN2_CCCR_CSR CSR **/
#define FDCAN2_CCCR_CSR		(1 << 4)
/** FDCAN2_CCCR_CSA CSA **/
#define FDCAN2_CCCR_CSA		(1 << 3)
/** FDCAN2_CCCR_ASM ASM **/
#define FDCAN2_CCCR_ASM		(1 << 2)
/** FDCAN2_CCCR_CCE CCE **/
#define FDCAN2_CCCR_CCE		(1 << 1)
/** FDCAN2_CCCR_INIT INIT **/
#define FDCAN2_CCCR_INIT		(1 << 0)

/**@}*/

/** @defgroup fdcan2_nbtp NBTP FDCAN_NBTP
@{*/


#define FDCAN2_NBTP_NSJW_SHIFT		25
#define FDCAN2_NBTP_NSJW_MASK		0x7f
/** @defgroup fdcan2_nbtp_nsjw NSJW NSJW
@{*/
/**@}*/


#define FDCAN2_NBTP_NBRP_SHIFT		16
#define FDCAN2_NBTP_NBRP_MASK		0x1ff
/** @defgroup fdcan2_nbtp_nbrp NBRP NBRP
@{*/
/**@}*/


#define FDCAN2_NBTP_NTSEG1_SHIFT		8
#define FDCAN2_NBTP_NTSEG1_MASK		0xff
/** @defgroup fdcan2_nbtp_ntseg1 NTSEG1 NTSEG1
@{*/
/**@}*/


#define FDCAN2_NBTP_TSEG2_SHIFT		0
#define FDCAN2_NBTP_TSEG2_MASK		0x7f
/** @defgroup fdcan2_nbtp_tseg2 TSEG2 TSEG2
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_tscc TSCC FDCAN Timestamp Counter Configuration Register
@{*/


#define FDCAN2_TSCC_TCP_SHIFT		16
#define FDCAN2_TSCC_TCP_MASK		0x0f
/** @defgroup fdcan2_tscc_tcp TCP TCP
@{*/
/**@}*/


#define FDCAN2_TSCC_TSS_SHIFT		0
#define FDCAN2_TSCC_TSS_MASK		0x03
/** @defgroup fdcan2_tscc_tss TSS TSS
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_tscv TSCV FDCAN Timestamp Counter Value Register
@{*/


#define FDCAN2_TSCV_TSC_SHIFT		0
#define FDCAN2_TSCV_TSC_MASK		0xffff
/** @defgroup fdcan2_tscv_tsc TSC TSC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_tocc TOCC FDCAN Timeout Counter Configuration Register
@{*/


#define FDCAN2_TOCC_TOP_SHIFT		16
#define FDCAN2_TOCC_TOP_MASK		0xffff
/** @defgroup fdcan2_tocc_top TOP TOP
@{*/
/**@}*/


#define FDCAN2_TOCC_TOS_SHIFT		1
#define FDCAN2_TOCC_TOS_MASK		0x03
/** @defgroup fdcan2_tocc_tos TOS TOS
@{*/
/**@}*/

/** FDCAN2_TOCC_ETOC ETOC **/
#define FDCAN2_TOCC_ETOC		(1 << 0)

/**@}*/

/** @defgroup fdcan2_tocv TOCV FDCAN Timeout Counter Value Register
@{*/


#define FDCAN2_TOCV_TOC_SHIFT		0
#define FDCAN2_TOCV_TOC_MASK		0xffff
/** @defgroup fdcan2_tocv_toc TOC TOC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_ecr ECR FDCAN Error Counter Register
@{*/


#define FDCAN2_ECR_CEL_SHIFT		16
#define FDCAN2_ECR_CEL_MASK		0xff
/** @defgroup fdcan2_ecr_cel CEL CEL
@{*/
/**@}*/

/** FDCAN2_ECR_RP RP **/
#define FDCAN2_ECR_RP		(1 << 15)

#define FDCAN2_ECR_TREC_SHIFT		8
#define FDCAN2_ECR_TREC_MASK		0x7f
/** @defgroup fdcan2_ecr_trec TREC TREC
@{*/
/**@}*/


