grevaillot/svd_tools/headers/STM32G473xx/fdcan2.h
#define FDCAN2_ECR_TEC_SHIFT		0
#define FDCAN2_ECR_TEC_MASK		0xff
/** @defgroup fdcan2_ecr_tec TEC TEC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_psr PSR FDCAN Protocol Status Register
@{*/


#define FDCAN2_PSR_TDCV_SHIFT		16
#define FDCAN2_PSR_TDCV_MASK		0x7f
/** @defgroup fdcan2_psr_tdcv TDCV TDCV
@{*/
/**@}*/

/** FDCAN2_PSR_PXE PXE **/
#define FDCAN2_PSR_PXE		(1 << 14)
/** FDCAN2_PSR_REDL REDL **/
#define FDCAN2_PSR_REDL		(1 << 13)
/** FDCAN2_PSR_RBRS RBRS **/
#define FDCAN2_PSR_RBRS		(1 << 12)
/** FDCAN2_PSR_RESI RESI **/
#define FDCAN2_PSR_RESI		(1 << 11)

#define FDCAN2_PSR_DLEC_SHIFT		8
#define FDCAN2_PSR_DLEC_MASK		0x07
/** @defgroup fdcan2_psr_dlec DLEC DLEC
@{*/
/**@}*/

/** FDCAN2_PSR_BO BO **/
#define FDCAN2_PSR_BO		(1 << 7)
/** FDCAN2_PSR_EW EW **/
#define FDCAN2_PSR_EW		(1 << 6)
/** FDCAN2_PSR_EP EP **/
#define FDCAN2_PSR_EP		(1 << 5)

#define FDCAN2_PSR_ACT_SHIFT		3
#define FDCAN2_PSR_ACT_MASK		0x03
/** @defgroup fdcan2_psr_act ACT ACT
@{*/
/**@}*/


#define FDCAN2_PSR_LEC_SHIFT		0
#define FDCAN2_PSR_LEC_MASK		0x07
/** @defgroup fdcan2_psr_lec LEC LEC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_tdcr TDCR FDCAN Transmitter Delay Compensation Register
@{*/


#define FDCAN2_TDCR_TDCO_SHIFT		8
#define FDCAN2_TDCR_TDCO_MASK		0x7f
/** @defgroup fdcan2_tdcr_tdco TDCO TDCO
@{*/
/**@}*/


#define FDCAN2_TDCR_TDCF_SHIFT		0
#define FDCAN2_TDCR_TDCF_MASK		0x7f
/** @defgroup fdcan2_tdcr_tdcf TDCF TDCF
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_ir IR The flags are set when one of the listed conditions is detected (edge-sensitive). The flags remain set until the Host clears them. A flag is cleared by writing a 1 to the corresponding bit position. Writing a 0 has no effect. A hard reset will clear the register. The configuration of IE controls whether an interrupt is generated. The configuration of ILS controls on which interrupt line an interrupt is signaled.
@{*/

/** FDCAN2_IR_ARA ARA **/
#define FDCAN2_IR_ARA		(1 << 29)
/** FDCAN2_IR_PED PED **/
#define FDCAN2_IR_PED		(1 << 28)
/** FDCAN2_IR_PEA PEA **/
#define FDCAN2_IR_PEA		(1 << 27)
/** FDCAN2_IR_WDI WDI **/
#define FDCAN2_IR_WDI		(1 << 26)
/** FDCAN2_IR_BO BO **/
#define FDCAN2_IR_BO		(1 << 25)
/** FDCAN2_IR_EW EW **/
#define FDCAN2_IR_EW		(1 << 24)
/** FDCAN2_IR_EP EP **/
#define FDCAN2_IR_EP		(1 << 23)
/** FDCAN2_IR_ELO ELO **/
#define FDCAN2_IR_ELO		(1 << 22)
/** FDCAN2_IR_DRX DRX **/
#define FDCAN2_IR_DRX		(1 << 19)
/** FDCAN2_IR_TOO TOO **/
#define FDCAN2_IR_TOO		(1 << 18)
/** FDCAN2_IR_MRAF MRAF **/
#define FDCAN2_IR_MRAF		(1 << 17)
/** FDCAN2_IR_TSW TSW **/
#define FDCAN2_IR_TSW		(1 << 16)
/** FDCAN2_IR_TEFL TEFL **/
#define FDCAN2_IR_TEFL		(1 << 15)
/** FDCAN2_IR_TEFF TEFF **/
#define FDCAN2_IR_TEFF		(1 << 14)
/** FDCAN2_IR_TEFW TEFW **/
#define FDCAN2_IR_TEFW		(1 << 13)
/** FDCAN2_IR_TEFN TEFN **/
#define FDCAN2_IR_TEFN		(1 << 12)
/** FDCAN2_IR_TFE TFE **/
#define FDCAN2_IR_TFE		(1 << 11)
/** FDCAN2_IR_TCF TCF **/
#define FDCAN2_IR_TCF		(1 << 10)
/** FDCAN2_IR_TC TC **/
#define FDCAN2_IR_TC		(1 << 9)
/** FDCAN2_IR_HPM HPM **/
#define FDCAN2_IR_HPM		(1 << 8)
/** FDCAN2_IR_RF1L RF1L **/
#define FDCAN2_IR_RF1L		(1 << 7)
/** FDCAN2_IR_RF1F RF1F **/
#define FDCAN2_IR_RF1F		(1 << 6)
/** FDCAN2_IR_RF1W RF1W **/
#define FDCAN2_IR_RF1W		(1 << 5)
/** FDCAN2_IR_RF1N RF1N **/
#define FDCAN2_IR_RF1N		(1 << 4)
/** FDCAN2_IR_RF0L RF0L **/
#define FDCAN2_IR_RF0L		(1 << 3)
/** FDCAN2_IR_RF0F RF0F **/
#define FDCAN2_IR_RF0F		(1 << 2)
/** FDCAN2_IR_RF0W RF0W **/
#define FDCAN2_IR_RF0W		(1 << 1)
/** FDCAN2_IR_RF0N RF0N **/
#define FDCAN2_IR_RF0N		(1 << 0)

/**@}*/

/** @defgroup fdcan2_ie IE The settings in the Interrupt Enable register determine which status changes in the Interrupt Register will be signaled on an interrupt line.
@{*/

/** FDCAN2_IE_ARAE ARAE **/
#define FDCAN2_IE_ARAE		(1 << 29)
/** FDCAN2_IE_PEDE PEDE **/
#define FDCAN2_IE_PEDE		(1 << 28)
/** FDCAN2_IE_PEAE PEAE **/
#define FDCAN2_IE_PEAE		(1 << 27)
/** FDCAN2_IE_WDIE WDIE **/
#define FDCAN2_IE_WDIE		(1 << 26)
/** FDCAN2_IE_BOE BOE **/
#define FDCAN2_IE_BOE		(1 << 25)
/** FDCAN2_IE_EWE EWE **/
#define FDCAN2_IE_EWE		(1 << 24)
/** FDCAN2_IE_EPE EPE **/
#define FDCAN2_IE_EPE		(1 << 23)
/** FDCAN2_IE_ELOE ELOE **/
#define FDCAN2_IE_ELOE		(1 << 22)
/** FDCAN2_IE_BEUE BEUE **/
#define FDCAN2_IE_BEUE		(1 << 21)
/** FDCAN2_IE_BECE BECE **/
#define FDCAN2_IE_BECE		(1 << 20)
/** FDCAN2_IE_DRX DRX **/
#define FDCAN2_IE_DRX		(1 << 19)
/** FDCAN2_IE_TOOE TOOE **/
#define FDCAN2_IE_TOOE		(1 << 18)
/** FDCAN2_IE_MRAFE MRAFE **/
#define FDCAN2_IE_MRAFE		(1 << 17)
/** FDCAN2_IE_TSWE TSWE **/
#define FDCAN2_IE_TSWE		(1 << 16)
/** FDCAN2_IE_TEFLE TEFLE **/
#define FDCAN2_IE_TEFLE		(1 << 15)
/** FDCAN2_IE_TEFFE TEFFE **/
#define FDCAN2_IE_TEFFE		(1 << 14)
/** FDCAN2_IE_TEFWE TEFWE **/
#define FDCAN2_IE_TEFWE		(1 << 13)
/** FDCAN2_IE_TEFNE TEFNE **/
#define FDCAN2_IE_TEFNE		(1 << 12)
/** FDCAN2_IE_TFEE TFEE **/
#define FDCAN2_IE_TFEE		(1 << 11)
/** FDCAN2_IE_TCFE TCFE **/
#define FDCAN2_IE_TCFE		(1 << 10)
/** FDCAN2_IE_TCE TCE **/
#define FDCAN2_IE_TCE		(1 << 9)
/** FDCAN2_IE_HPME HPME **/
#define FDCAN2_IE_HPME		(1 << 8)
/** FDCAN2_IE_RF1LE RF1LE **/
#define FDCAN2_IE_RF1LE		(1 << 7)
/** FDCAN2_IE_RF1FE RF1FE **/
#define FDCAN2_IE_RF1FE		(1 << 6)
/** FDCAN2_IE_RF1WE RF1WE **/
#define FDCAN2_IE_RF1WE		(1 << 5)
/** FDCAN2_IE_RF1NE RF1NE **/
#define FDCAN2_IE_RF1NE		(1 << 4)
/** FDCAN2_IE_RF0LE RF0LE **/
#define FDCAN2_IE_RF0LE		(1 << 3)
/** FDCAN2_IE_RF0FE RF0FE **/
#define FDCAN2_IE_RF0FE		(1 << 2)
/** FDCAN2_IE_RF0WE RF0WE **/
#define FDCAN2_IE_RF0WE		(1 << 1)
/** FDCAN2_IE_RF0NE RF0NE **/
#define FDCAN2_IE_RF0NE		(1 << 0)

/**@}*/

/** @defgroup fdcan2_ils ILS The Interrupt Line Select register assigns an interrupt generated by a specific interrupt flag from the Interrupt Register to one of the two module interrupt lines. For interrupt generation the respective interrupt line has to be enabled via ILE[EINT0] and ILE[EINT1].
@{*/

/** FDCAN2_ILS_ARAL ARAL **/
#define FDCAN2_ILS_ARAL		(1 << 29)
/** FDCAN2_ILS_PEDL PEDL **/
#define FDCAN2_ILS_PEDL		(1 << 28)
/** FDCAN2_ILS_PEAL PEAL **/
#define FDCAN2_ILS_PEAL		(1 << 27)
/** FDCAN2_ILS_WDIL WDIL **/
#define FDCAN2_ILS_WDIL		(1 << 26)
/** FDCAN2_ILS_BOL BOL **/
#define FDCAN2_ILS_BOL		(1 << 25)
/** FDCAN2_ILS_EWL EWL **/
#define FDCAN2_ILS_EWL		(1 << 24)
/** FDCAN2_ILS_EPL EPL **/
#define FDCAN2_ILS_EPL		(1 << 23)
/** FDCAN2_ILS_ELOL ELOL **/
#define FDCAN2_ILS_ELOL		(1 << 22)
/** FDCAN2_ILS_BEUL BEUL **/
#define FDCAN2_ILS_BEUL		(1 << 21)
/** FDCAN2_ILS_BECL BECL **/
#define FDCAN2_ILS_BECL		(1 << 20)
/** FDCAN2_ILS_DRXL DRXL **/
#define FDCAN2_ILS_DRXL		(1 << 19)
/** FDCAN2_ILS_TOOL TOOL **/
#define FDCAN2_ILS_TOOL		(1 << 18)
/** FDCAN2_ILS_MRAFL MRAFL **/
#define FDCAN2_ILS_MRAFL		(1 << 17)
/** FDCAN2_ILS_TSWL TSWL **/
#define FDCAN2_ILS_TSWL		(1 << 16)
/** FDCAN2_ILS_TEFLL TEFLL **/
#define FDCAN2_ILS_TEFLL		(1 << 15)
/** FDCAN2_ILS_TEFFL TEFFL **/
#define FDCAN2_ILS_TEFFL		(1 << 14)
/** FDCAN2_ILS_TEFWL TEFWL **/
#define FDCAN2_ILS_TEFWL		(1 << 13)
/** FDCAN2_ILS_TEFNL TEFNL **/
#define FDCAN2_ILS_TEFNL		(1 << 12)
/** FDCAN2_ILS_TFEL TFEL **/
#define FDCAN2_ILS_TFEL		(1 << 11)
/** FDCAN2_ILS_TCFL TCFL **/
#define FDCAN2_ILS_TCFL		(1 << 10)
/** FDCAN2_ILS_TCL TCL **/
#define FDCAN2_ILS_TCL		(1 << 9)
/** FDCAN2_ILS_HPML HPML **/
#define FDCAN2_ILS_HPML		(1 << 8)
/** FDCAN2_ILS_RF1LL RF1LL **/
#define FDCAN2_ILS_RF1LL		(1 << 7)
/** FDCAN2_ILS_RF1FL RF1FL **/
#define FDCAN2_ILS_RF1FL		(1 << 6)
/** FDCAN2_ILS_RF1WL RF1WL **/
#define FDCAN2_ILS_RF1WL		(1 << 5)
/** FDCAN2_ILS_RF1NL RF1NL **/
#define FDCAN2_ILS_RF1NL		(1 << 4)
/** FDCAN2_ILS_RF0LL RF0LL **/
#define FDCAN2_ILS_RF0LL		(1 << 3)
/** FDCAN2_ILS_RF0FL RF0FL **/
#define FDCAN2_ILS_RF0FL		(1 << 2)
/** FDCAN2_ILS_RF0WL RF0WL **/
#define FDCAN2_ILS_RF0WL		(1 << 1)
/** FDCAN2_ILS_RF0NL RF0NL **/
#define FDCAN2_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup fdcan2_ile ILE Each of the two interrupt lines to the CPU can be enabled/disabled separately by programming bits EINT0 and EINT1.
@{*/

/** FDCAN2_ILE_EINT1 EINT1 **/
#define FDCAN2_ILE_EINT1		(1 << 1)
/** FDCAN2_ILE_EINT0 EINT0 **/
#define FDCAN2_ILE_EINT0		(1 << 0)

/**@}*/

