grevaillot/svd_tools/headers/STM32G473xx/fdcan2.h
/** @defgroup fdcan2_rxgfc RXGFC Global settings for Message ID filtering. The Global Filter Configuration controls the filter path for standard and extended messages as described in Figure706: Standard Message ID filter path and Figure707: Extended Message ID filter path.
@{*/


#define FDCAN2_RXGFC_ANFS_SHIFT		4
#define FDCAN2_RXGFC_ANFS_MASK		0x03
/** @defgroup fdcan2_rxgfc_anfs ANFS ANFS
@{*/
/**@}*/


#define FDCAN2_RXGFC_ANFE_SHIFT		2
#define FDCAN2_RXGFC_ANFE_MASK		0x03
/** @defgroup fdcan2_rxgfc_anfe ANFE ANFE
@{*/
/**@}*/

/** FDCAN2_RXGFC_RRFS RRFS **/
#define FDCAN2_RXGFC_RRFS		(1 << 1)
/** FDCAN2_RXGFC_RRFE RRFE **/
#define FDCAN2_RXGFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup fdcan2_xidam XIDAM FDCAN Extended ID and Mask Register
@{*/


#define FDCAN2_XIDAM_EIDM_SHIFT		0
#define FDCAN2_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup fdcan2_xidam_eidm EIDM EIDM
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_hpms HPMS This register is updated every time a Message ID filter element configured to generate a priority event match. This can be used to monitor the status of incoming high priority messages and to enable fast access to these messages.
@{*/

/** FDCAN2_HPMS_FLST FLST **/
#define FDCAN2_HPMS_FLST		(1 << 15)

#define FDCAN2_HPMS_FIDX_SHIFT		8
#define FDCAN2_HPMS_FIDX_MASK		0x7f
/** @defgroup fdcan2_hpms_fidx FIDX FIDX
@{*/
/**@}*/


#define FDCAN2_HPMS_MSI_SHIFT		6
#define FDCAN2_HPMS_MSI_MASK		0x03
/** @defgroup fdcan2_hpms_msi MSI MSI
@{*/
/**@}*/


#define FDCAN2_HPMS_BIDX_SHIFT		0
#define FDCAN2_HPMS_BIDX_MASK		0x3f
/** @defgroup fdcan2_hpms_bidx BIDX BIDX
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_rxf0s RXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** FDCAN2_RXF0S_RF0L RF0L **/
#define FDCAN2_RXF0S_RF0L		(1 << 25)
/** FDCAN2_RXF0S_F0F F0F **/
#define FDCAN2_RXF0S_F0F		(1 << 24)

#define FDCAN2_RXF0S_F0PI_SHIFT		16
#define FDCAN2_RXF0S_F0PI_MASK		0x3f
/** @defgroup fdcan2_rxf0s_f0pi F0PI F0PI
@{*/
/**@}*/


#define FDCAN2_RXF0S_F0GI_SHIFT		8
#define FDCAN2_RXF0S_F0GI_MASK		0x3f
/** @defgroup fdcan2_rxf0s_f0gi F0GI F0GI
@{*/
/**@}*/


#define FDCAN2_RXF0S_F0FL_SHIFT		0
#define FDCAN2_RXF0S_F0FL_MASK		0x7f
/** @defgroup fdcan2_rxf0s_f0fl F0FL F0FL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_rxf0a RXF0A CAN Rx FIFO 0 Acknowledge Register
@{*/


#define FDCAN2_RXF0A_F0AI_SHIFT		0
#define FDCAN2_RXF0A_F0AI_MASK		0x3f
/** @defgroup fdcan2_rxf0a_f0ai F0AI F0AI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_rxf1s RXF1S FDCAN Rx FIFO 1 Status Register
@{*/


#define FDCAN2_RXF1S_DMS_SHIFT		30
#define FDCAN2_RXF1S_DMS_MASK		0x03
/** @defgroup fdcan2_rxf1s_dms DMS DMS
@{*/
/**@}*/

/** FDCAN2_RXF1S_RF1L RF1L **/
#define FDCAN2_RXF1S_RF1L		(1 << 25)
/** FDCAN2_RXF1S_F1F F1F **/
#define FDCAN2_RXF1S_F1F		(1 << 24)

#define FDCAN2_RXF1S_F1PI_SHIFT		16
#define FDCAN2_RXF1S_F1PI_MASK		0x3f
/** @defgroup fdcan2_rxf1s_f1pi F1PI F1PI
@{*/
/**@}*/


#define FDCAN2_RXF1S_F1GI_SHIFT		8
#define FDCAN2_RXF1S_F1GI_MASK		0x3f
/** @defgroup fdcan2_rxf1s_f1gi F1GI F1GI
@{*/
/**@}*/


#define FDCAN2_RXF1S_F1FL_SHIFT		0
#define FDCAN2_RXF1S_F1FL_MASK		0x7f
/** @defgroup fdcan2_rxf1s_f1fl F1FL F1FL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_rxf1a RXF1A FDCAN Rx FIFO 1 Acknowledge Register
@{*/


#define FDCAN2_RXF1A_F1AI_SHIFT		0
#define FDCAN2_RXF1A_F1AI_MASK		0x3f
/** @defgroup fdcan2_rxf1a_f1ai F1AI F1AI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbc TXBC FDCAN Tx Buffer Configuration Register
@{*/

/** FDCAN2_TXBC_TFQM TFQM **/
#define FDCAN2_TXBC_TFQM		(1 << 30)

#define FDCAN2_TXBC_TFQS_SHIFT		24
#define FDCAN2_TXBC_TFQS_MASK		0x3f
/** @defgroup fdcan2_txbc_tfqs TFQS TFQS
@{*/
/**@}*/


#define FDCAN2_TXBC_NDTB_SHIFT		16
#define FDCAN2_TXBC_NDTB_MASK		0x3f
/** @defgroup fdcan2_txbc_ndtb NDTB NDTB
@{*/
/**@}*/


#define FDCAN2_TXBC_TBSA_SHIFT		2
#define FDCAN2_TXBC_TBSA_MASK		0x3fff
/** @defgroup fdcan2_txbc_tbsa TBSA TBSA
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txfqs TXFQS The Tx FIFO/Queue status is related to the pending Tx requests listed in register TXBRP. Therefore the effect of Add/Cancellation requests may be delayed due to a running Tx scan (TXBRP not yet updated).
@{*/

/** FDCAN2_TXFQS_TFQF TFQF **/
#define FDCAN2_TXFQS_TFQF		(1 << 21)

#define FDCAN2_TXFQS_TFQPI_SHIFT		16
#define FDCAN2_TXFQS_TFQPI_MASK		0x1f
/** @defgroup fdcan2_txfqs_tfqpi TFQPI TFQPI
@{*/
/**@}*/


#define FDCAN2_TXFQS_TFGI_SHIFT		8
#define FDCAN2_TXFQS_TFGI_MASK		0x1f
/** @defgroup fdcan2_txfqs_tfgi TFGI TFGI
@{*/
/**@}*/


#define FDCAN2_TXFQS_TFFL_SHIFT		0
#define FDCAN2_TXFQS_TFFL_MASK		0x3f
/** @defgroup fdcan2_txfqs_tffl TFFL TFFL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbrp TXBRP FDCAN Tx Buffer Request Pending Register
@{*/


#define FDCAN2_TXBRP_TRP_SHIFT		0
#define FDCAN2_TXBRP_TRP_MASK		0xffffffff
/** @defgroup fdcan2_txbrp_trp TRP TRP
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbar TXBAR FDCAN Tx Buffer Add Request Register
@{*/


#define FDCAN2_TXBAR_AR_SHIFT		0
#define FDCAN2_TXBAR_AR_MASK		0xffffffff
/** @defgroup fdcan2_txbar_ar AR AR
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbcr TXBCR FDCAN Tx Buffer Cancellation Request Register
@{*/


#define FDCAN2_TXBCR_CR_SHIFT		0
#define FDCAN2_TXBCR_CR_MASK		0xffffffff
/** @defgroup fdcan2_txbcr_cr CR CR
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbto TXBTO FDCAN Tx Buffer Transmission Occurred Register
@{*/


#define FDCAN2_TXBTO_TO_SHIFT		0
#define FDCAN2_TXBTO_TO_MASK		0xffffffff
/** @defgroup fdcan2_txbto_to TO TO
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbcf TXBCF FDCAN Tx Buffer Cancellation Finished Register
@{*/


#define FDCAN2_TXBCF_CF_SHIFT		0
#define FDCAN2_TXBCF_CF_MASK		0xffffffff
/** @defgroup fdcan2_txbcf_cf CF CF
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbtie TXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register
@{*/


#define FDCAN2_TXBTIE_TIE_SHIFT		0
#define FDCAN2_TXBTIE_TIE_MASK		0xffffffff
/** @defgroup fdcan2_txbtie_tie TIE TIE
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txbcie TXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register
@{*/


#define FDCAN2_TXBCIE_CFIE_SHIFT		0
#define FDCAN2_TXBCIE_CFIE_MASK		0xffffffff
/** @defgroup fdcan2_txbcie_cfie CFIE CFIE
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txefs TXEFS FDCAN Tx Event FIFO Status Register
@{*/

/** FDCAN2_TXEFS_TEFL TEFL **/
#define FDCAN2_TXEFS_TEFL		(1 << 25)
/** FDCAN2_TXEFS_EFF EFF **/
#define FDCAN2_TXEFS_EFF		(1 << 24)

#define FDCAN2_TXEFS_EFPI_SHIFT		16
#define FDCAN2_TXEFS_EFPI_MASK		0x1f
/** @defgroup fdcan2_txefs_efpi EFPI EFPI
@{*/
/**@}*/


#define FDCAN2_TXEFS_EFGI_SHIFT		8
#define FDCAN2_TXEFS_EFGI_MASK		0x1f
/** @defgroup fdcan2_txefs_efgi EFGI EFGI
@{*/
/**@}*/


#define FDCAN2_TXEFS_EFFL_SHIFT		0
#define FDCAN2_TXEFS_EFFL_MASK		0x3f
/** @defgroup fdcan2_txefs_effl EFFL EFFL
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_txefa TXEFA FDCAN Tx Event FIFO Acknowledge Register
@{*/


#define FDCAN2_TXEFA_EFAI_SHIFT		0
#define FDCAN2_TXEFA_EFAI_MASK		0x1f
/** @defgroup fdcan2_txefa_efai EFAI EFAI
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_ckdiv CKDIV FDCAN CFG clock divider register
@{*/


#define FDCAN2_CKDIV_PDIV_SHIFT		0
#define FDCAN2_CKDIV_PDIV_MASK		0x0f
/** @defgroup fdcan2_ckdiv_pdiv PDIV input clock divider. the APB clock could be divided prior to be used by the CAN sub
@{*/
/**@}*/


/**@}*/
